ka2_2024/src/InformationRegisters/ДоговорыУчастниковКонтролируемыхСделок/ДоговорыУчастниковКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорыУчастниковКонтролируемыхСделок</name>
  <resources>
    <name>КодНаименованияСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияЦеныСделки</name>
    <type>
      <types>CatalogRef.СпособыОпределенияЦенКонтролируемыхСделок</types>
    </type>
  </resources>
  <resources>
    <name>КодУсловийПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтороныПрименяютРазныеСтавкиПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаОтноситсяКДеятельностиНовогоМорскогоМесторождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СделкаОтноситсяКДеятельностиОблагаемойНалогомНаДопДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/ДоговорыУчастниковКонтролируемыхСделок/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СписокКодовНаименованийСделок = КонтролируемыеСделкиПовтИсп.СписокКодовНаименованийСделки();
	СписокКодовПоставки = КонтролируемыеСделкиПовтИсп.КодыУсловийПоставки();
	УстановитьПривилегированныйРежим(Ложь);
	
	Элементы.КодНаименованияСделки.СписокВыбора.Очистить();
	Для Каждого Код Из СписокКодовНаименованийСделок Цикл
		НовыйКод = Элементы.КодНаименованияСделки.СписокВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйКод, Код);
	КонецЦикла;
	
	Элементы.КодУсловийПоставки.СписокВыбора.Очистить();
	Для Каждого Код Из СписокКодовПоставки Цикл
		НовыйКод = Элементы.КодУсловийПоставки.СписокВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйКод, Код);
	КонецЦикла;
	
	ДоступностьКлючевыхЗаписей = Истина;
	Если Параметры.Свойство("ДоступностьКлючевыхЗаписей") Тогда
		ДоступностьКлючевыхЗаписей = Параметры.ДоступностьКлючевыхЗаписей;
	КонецЕсли;
	
	Элементы.Организация.ТолькоПросмотр 			= НЕ ДоступностьКлючевыхЗаписей;
	Элементы.ДоговорКонтрагента.ТолькоПросмотр 	= НЕ ДоступностьКлючевыхЗаписей;
	Элементы.Контрагент.ТолькоПросмотр 			= НЕ ДоступностьКлючевыхЗаписей;
	
	Элементы.КодНаименованияСделки.АвтоОтметкаНезаполненного 			= Не ДоступностьКлючевыхЗаписей;
	Элементы.ПризнакОпределенияЦеныСделки.АвтоОтметкаНезаполненного 	= Не ДоступностьКлючевыхЗаписей;
	
	Если ДоступностьКлючевыхЗаписей Тогда
		НастроитьДоговор();
	КонецЕсли;
	
	КонтролируемыеСделки.ЗаполнитьСписокГоловныхОрганизаций(Элементы.Организация.СписокВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	НастроитьДоговор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДоговор()
	
	Элементы.ДоговорКонтрагента.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Запись.Контрагент);
	
	Если ЗначениеЗаполнено(Запись.Контрагент) Тогда
		
		Если ТипЗнч(Запись.Контрагент) = Тип("СправочникСсылка.Организации") Тогда
			
			ТипПоляДоговор = Новый ОписаниеТипов("СправочникСсылка.ДоговорыМеждуОрганизациями");
			
		Иначе
			
			ТипыДоговоров = Новый Массив;
			ТипыДоговоров.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
			ТипыДоговоров.Добавить(Тип("СправочникСсылка.ДоговорыАренды"));
			ТипыДоговоров.Добавить(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
			ТипПоляДоговор = Новый ОписаниеТипов(ТипыДоговоров);
			
		КонецЕсли;
		
		Элементы.ДоговорКонтрагента.ОграничениеТипа = ТипПоляДоговор;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
